//캔버스 만들기
function setup() {
  createCanvas(600, 400);
}
function draw() {
  background(200); 
  //창문과 벽, 창문 안의 해
  stroke(0);
  strokeWeight(5);
  fill(0, 0, 200); 
  rect(520, 50, 60, 150);
  fill(255, 0, 0); 
  noStroke();
  ellipse(550, 80, 40, 40);
  
  //벽 무늬
  stroke(100);
  noFill();
  circle(530, 30, 10);
  square(547.5, 26, 10);
  circle(575, 30, 10);
  arc(520, 250, 40, 40, 180, 360);
  arc(560, 250, 40, 40, 0, 180);
  arc(550, 300, 40, 40, 180, 360);
  arc(590, 300, 40, 40, 0, 180);
  arc(520, 350, 40, 40, 180, 360);
  arc(560, 350, 40, 40, 0, 180);
  
  //좌석색깔
  stroke(0, 0, 100);
  strokeWeight(3);
  fill(0,0,100);
  rect(0, 200, 497, 160);
  
  //좌석 
  stroke(0);
  strokeWeight(3);
  line(0, 200, 497, 200);
  line(0, 280, 497, 280);
  line(0, 360, 497, 360);
  
  line(50,200,20,280);
  line(160,200,130,280);
  line(270,200,240,280);
  line(380,200,350,280);
  line(490,200,460,280);
  line(20,280,-30,360);
  line(130,280,80,360);
  line(240,280,190,360);
  line(350,280,300,360);
  line(460,280,410,360);

  //손잡이들
  stroke(0,255,0);
  strokeWeight(5);
  fill(0, 255, 0); 
  rect(85, 80, 30, 80); 
  noFill();
  triangle(80, 210, 120, 210, 100, 160);
  line(100,40,100,80)
  
  fill(0, 255, 0); 
  rect(185, 80, 30, 80); 
  noFill();
  triangle(180, 210, 220, 210, 200, 160);
  line(200,40,200,80)
  
  fill(0, 255, 0);
  rect(285, 80, 30, 80); 
  noFill();
  triangle(280, 210, 320, 210, 300, 160);
  line(300,40,300,80);

  fill(0, 255, 0); 
  rect(385, 80, 30, 80); 
  noFill();
  triangle(380, 210, 420, 210, 400, 160);
  line(400,40,400,80);
  
  //가로 봉, 세로 봉
  stroke(0);
  strokeWeight(7);
  line(0, 40, 500, 40);
  line(500, 0, 500, 450); 

  //히터
  fill(100);
  noStroke();
  quad(60, 370, 450, 370, 450, 450, 60, 430);
  
  stroke(0);
  strokeWeight(2);
  line(80,390,120,390);
  line(140,390,180,390);
  line(200,390,240,390);
  line(260,390,300,390);
  line(320,390,360,390);
  line(380,390,420,390);
}